VPro/src/Catalogs/EmployeesCalendarsRecords/EmployeesCalendarsRecords.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>EmployeesCalendarsRecords</name>
  <attributes>
    <name>ETag</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Source</name>
    <type>
      <types>DefinedType.CalendarRecordsSource</types>
    </type>
  </attributes>
  <attributes>
    <name>Calendar</name>
    <type>
      <types>CatalogRef.EmployeesCalendars</types>
    </type>
  </attributes>
  <attributes>
    <name>Key</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Begin</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceRowNumber</name>
    <comment>Для связи со строкой табличной части источника</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>End</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionFull</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>EditProhibited</name>
    <comment>Запрет интерактивного редактирования записи в планировщике</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

VPro/src/Catalogs/EmployeesCalendarsRecords/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If TypeOf(FillingData) = Type("Structure") Then
		FillPropertyValues(ThisObject, FillingData);
	EndIf;
	
	AddByDefault();
	
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If End < Begin Then
		CommonUseClientServer.MessageToUser(
		NStr("en='End date cannot be less than the start date.';ru='Дата окончания не может быть меньше даты начала.';vi='Ngày kết thúc không thể nhỏ hơn ngày bắt đầu.'"),
		ThisObject,
		"End",
		,
		Cancel);
	EndIf;
	
EndProcedure

Procedure BeforeWrite(Cancel)
		
	DataExchange.Recipients.AutoFill = False;
	DataExchange.Recipients.Clear();
	
	If DataExchange.Load Then
		Return;
	EndIf;
		
EndProcedure

#EndRegion

#Region InternalProceduresAndFunctions

Procedure AddByDefault()
	
	If ValueIsFilled(Calendar) Then
		Return;
	EndIf;
	
	Calendar = SmallBusinessReUse.GetValueOfSetting("DefaultCalendar");
	
EndProcedure

#EndRegion

#EndIf
